# ReloadLatestDeletedLastOpenView Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ViewFailures..::..ReloadLatestDeletedLastOpenView Property
BuiltInFailures..::..ViewFailures Class See Also
---
The only open view has been deleted because of changes from the Central Model. Open another view and Reload Latest or Synchronize with Central again.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ReloadLatestDeletedLastOpenView { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ReloadLatestDeletedLastOpenView As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ReloadLatestDeletedLastOpenView {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ViewFailures Class
Autodesk.Revit.DB Namespace